package com.shahadathossain.newsprotidin;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Color;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Random;

public class MainActivity extends AppCompatActivity {

 ListView ListNews;
 ArrayList< HashMap<String,String>> arrayList= new ArrayList();
 HashMap<String,String> hashMap;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        ListNews = findViewById(R.id.ListNews);


        createTable();
        MyAdapter myAdapter = new MyAdapter();
        ListNews.setAdapter(myAdapter);




        }
        private class MyAdapter extends BaseAdapter{

            @Override
            public int getCount() {
                return arrayList.size();
            }

            @Override
            public Object getItem(int i) {
                return null;
            }

            @Override
            public long getItemId(int i) {
                return 0;
            }

            @Override
            public View getView(int position, View view, ViewGroup viewGroup) {

                LayoutInflater layoutInflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
                View view1= layoutInflater.inflate(R.layout.layout2,viewGroup, false);

                ImageView ImageCover = view1.findViewById(R.id.ImageCover);
                TextView TachView = view1.findViewById(R.id.TachView);
                TextView Title = view1.findViewById(R.id.Title);
                TextView Descript = view1.findViewById(R.id.Descript);
                LinearLayout LayAll =view1.findViewById(R.id.LayAll);

                HashMap<String,String> hashMap = arrayList.get(position);


                String cat = hashMap.get("cat");
                String image_url = hashMap.get("image_url");
                String title = hashMap.get("title");
                String des = hashMap.get("des");

                Picasso.get().load(image_url).into(ImageCover);

                TachView.setText(cat);
                Title.setText(title);
                Descript.setText(des);


                Random rnd = new Random();
                int color = Color.argb(255, rnd.nextInt(256), rnd.nextInt(256), rnd.nextInt(256));
                TachView.setBackgroundColor(color);



              LayAll.setOnClickListener(new View.OnClickListener() {
                  @Override
                  public void onClick(View view) {


                      MainActivity2.TITLE = title;
                      MainActivity2.DESCRIPTION = des;
                      Bitmap bitmap = ( (BitmapDrawable) ImageCover.getDrawable()).getBitmap();
                      MainActivity2.MY_BITMAP = bitmap;
                      startActivity(new Intent(MainActivity.this, MainActivity2.class));

                  }
              });




                return view1;
            }


            }
            private void  createTable() {

        hashMap = new HashMap<>();
        hashMap.put("cat","Tech");
        hashMap.put("image_url", "https://static-cf.akamaized.net/images/01gj4zc6svp3cv7v1j4e84tj4c/5g.jpg?impolicy=All_policy&im=Crop,rect=(0,1,800,450);Resize=(690,390)");
        hashMap.put("title", "বাজারে আসার আগেই আলোচনায় শাওমি রেডমি কে৬০");
        hashMap.put("des", "বাজারে আসার আগেই আলোচনায় এসেছে শাওমির আপকামিং স্মার্টফোন রেডমি কে৬০। পরবর্তী প্রজন্মের এই স্মার্টফোন শিগগিরই বাজারে ছাড়ার প্রস্তুতি নিচ্ছে শাওমি। ফাঁস হওয়া ছবি ও তথ্য মতে, নতুন ফোন রেডমি কে৫০ মডেলের তুলনায় ভিন্ন রিয়ার ডিজাইন দেখা যাবে।\n" +
                "\n" +
                "সদ্য ফাঁস হওয়া রেন্ডারটি নতুন রেডমি কে৬০ সিরিজের স্মার্টফোনটির ফ্রন্ট এবং রিয়ার উভয় প্যানেলের ডিজাইনটি প্রদর্শন করেছে। রেন্ডার অনুযায়ী, এতে একটি পাঞ্চ-হোল কাটআউটসহ একটি ফ্ল্যাট ডিসপ্লে থাকবে। এই ফোনটির ডিসপ্লের চারধারের বেজেলগুলো কিছুটা স্থূল, যা উচ্চ মূল্যের স্মার্টফোনের থেকে প্রত্যাশিত নয়।ফোনটির পেছনে কার্ভড প্রান্তগুলোর সঙ্গে আয়তকার ক্যামেরা মডিউল দেখা যাবে। উল্লম্বভাবে সাজানো ক্যামেরা সেটআপের মধ্যে, ওপরের দিকে একটি ছোট সেন্সর, তারপর একটি অপেক্ষাকৃত বড় লেন্স এবং একদম নিচে একটি বর্গাকার আকৃতির ক্যামেরা দেখতে পাওয়া যাবে।\n" +
                "\n" +
                "রেডমি কে৬০ স্মার্টফোনের ডিসপ্লে হবে ৬.৬৭ ইঞ্চির। এতে অ্যামোলিড ডিসপ্লে প্যানেল ব্যবহৃত হচ্ছে। যার রিফ্রেশ রেট হবে ১২০ হার্টজ। ফোনটি মিডিয়াটেক ডাইমেনসিটি ৮২০০ চিপসেট দ্বারা চালিত হবে।\n" +
                "\n" +
                "পাওয়ার ব্যাকআপের জন্য, এতে ৫৫০০ এমএএইচ ক্ষমতাসম্পন্ন ব্যাটারি থাকতে পারে, যা ৬৭ ওয়াট ফাস্ট চার্জিং সাপোর্ট করবে। বিশেষ ফিচার হিসেবে হ্যান্ডসেটটিতে অপটিক্যাল ইমেজ স্ট্যাবিলাইজেশন (ওআইএস) সাপোর্টসহ ৬৪ মেগাপিক্সেলের সনি আইএমএক্স৬৮৬ প্রাইমারি ক্যামেরাও দেখা যাবে। ");
        arrayList.add(hashMap);





                hashMap = new HashMap<>();
                hashMap.put("cat","Game");
                hashMap.put("image_url", "https://bengali.cdn.zeenews.com/bengali/sites/default/files/2022/04/06/371119-suicide.jpg");
                hashMap.put("title", "গেম খেলতে পরিবারের বারণ, 'অভিমানে' আত্মঘাতী কিশোর");
                hashMap.put("des", " মোবাইল গেমের প্রতি আসক্তি প্রবল। তাই বাধা পেয়ে চরম সিদ্ধান্ত নিল কিশোর। ঘটনাটি ঘটেছে জলপাইগুড়ি জেলার বানারহাট ব্লকের শালবাড়ি ২ নং গ্রাম পঞ্চায়েত এলাকায়। ফ্রি ফায়ার গেম খেলতে না দেওয়ায় আত্মঘাতী ১৬ বছরের এক ছাত্র। পরিবার সূত্রের দাবি, লকডাউনের সময় স্থানীয় পাড়া-প্রতিবেশী যুবকদের সঙ্গে পাবজি গেমে মত্ত হয়েছিল ওই ছাত্র। তাই বাধ্য হয়ে আর্থিক অবস্থা সংকট থাকা সত্ত্বেও বছর ১৬র ওই ছাত্রকে একটি মোবাইল কিনে দেয় তার বাবা। তবে মোবাইল গেমে আসতে আসতে আসক্ত হয়ে পড়ে সে।\n" +
                        "\n" +
                        "তবে এদিন ছাত্রের মা মোবাইলে ফ্রি-ফায়ারায় গেম খেলতে বারণ করে। দীর্ঘক্ষণ আটকে রাখে তার মোবাইল। আর তাতেই অভিমান করে আত্মঘাতী হল ওই কিশোর। পরিবার সূত্রে দাবি এমনটাই। বাড়ির পাশের বাঁশঝাড়ে আত্মহত্যা করে ওই ছাত্র। ঘটনায় ব্যাপক চাঞ্চল্য ছড়িয়েছে এলাকায়। বুধবার মৃতদেহ ময়না তদন্তের জন্য জলপাইগুড়ি সুপার স্পেশালিটি হাসপাতালে মর্গে পাঠানো হয়।\n" +
                        "\n" +
                        "প্রসঙ্গত, ঘটনাচক্রে ১৪ ফেব্রুয়ারি ভারত সরকার ব্যান করে দেয় গারেনা ফ্রি ফায়ার গেম। তার ঠিক একদিন আগেই ঘটে যায় মর্মান্তিক এই ঘটনা। এর আগে ভারতে পাবজি মোবাইল গেমও ব্যান করে দিয়েছে কেন্দ্র। তার পর থেকেই এ দেশে জনপ্রিয় হয়ে উঠতে শুরু করে গারেনা ফ্রি ফায়ার গেম। সম্প্রতি ভারত সরকার এই গারেনা ফ্রি ফায়ার গেমও ব্যান করে দেয়। ");
                arrayList.add(hashMap);





                hashMap = new HashMap<>();
                hashMap.put("cat","Discover");
                hashMap.put("image_url", "https://www.kalerkantho.com/assets/news_images/2022/11/10/2303242_kalerkantho-2022--10-pic-.jpg");
                hashMap.put("title", "বৈজ্ঞানিক বিপ্লবের অগ্রদূত ইবনে আল-শাতির");
                hashMap.put("des", "পৃথিবী বিখ্যাত মুসলিম বিজ্ঞানী ইবনে আল-শাতির। তাঁর পূর্ণ নাম আল-আলাদিন আবুল হাসান আলী ইবনে ইব্রাহিম ইবনে আল-শাতির। জন্ম ১৩০৪ সালে। তিনি ছিলেন একজন আরব মুসলিম জ্যোতির্বিজ্ঞানী, গণিতজ্ঞ, প্রকৌশলী ও আবিষ্কারক। তিনি সিরিয়ার দামেস্কে বিখ্যাত উমাইয়া মসজিদে মুয়াক্কি বা সময়রক্ষক হিসেবে কাজ করতেন। এ কাজের জন্য তার সময় দেখতে হতো। সময় দেখার জন্য তার জ্যোতির্বিজ্ঞান বিষয়ক জ্ঞান থাকার প্রয়োজন হতো। আর এভাবে তিনি বিশ্ববিখ্যাত জ্যোতির্বিজ্ঞানীতে পরিণত হয়েছিলেন। ইবনে আল-শাতির হলেন জ্যোতির্বিদ্যায় বৈজ্ঞানিক বিপ্লবের অগ্রদূত।\n" +
                        "জ্যোতির্বিজ্ঞানবিষয়ক সবচেয়ে গুরুত্বপূর্ণ কাজটি হলো, ‘কিতাব নিহায়াত আল-সাল ফি তাশহি আল-উসুল  (The Final quest Concerning the Rectification of the planetary Principles)\n" +
                        "\n" +
                        "। বইটিতে তিনি নিজস্ব মডেল ব্যবহারের মাধ্যমে সূর্য, চন্দ  ও গ্রহ নক্ষত্রের টলেমি মডেল ব্যাপকভাবে সংশোধন করেন। ইবনে আল-শাতির তার মডেলে এপিসাইকেল বা বৃহত্তর বৃত্তে অপেক্ষাকৃত ক্ষুদ্র বৃত্তের ভেতর নির্দিষ্ট কক্ষপথে গ্রহগুলোর আবর্তনের ধারণা পরিত্যাগ করেন। তুসি কাপল-এর মধ্য দিয়ে তিনি বহুকেন্দ্রিকতা ও ইকুয়ান্ট প্রত্যাখ্যান করেন। এ ছাড়া তিনি লিউনার মডেলের সব বহুকেন্দ্রিকতা, এপিসাইকেল ও ইকুয়ান্ট বর্জন করেন। পূর্ববর্তী মারাগা মানমন্দিরের মডেল ছিল টলেমি মডেলের মতো নিল। কিন্তু আল-শাতিরের জ্যামিতিক মডেল ছিল টলেমির মডেলের চেয়ে সত্যিকারভাবে উন্নততর। তিনি বিজ্ঞানসম্মত পর্যবেক্ষণের ওপর নির্ভরশীল ছিলেন। দার্শনিক যুক্তির পরিবর্তে পরীক্ষা-নিরীক্ষার ভিত্তিতে টলেমি মডেল বর্জন করা ছিল আল-শাতিরের আরেকটি সাফল্য। পূর্ববর্তী বিজ্ঞানীরা সৃষ্টিতত্ত্ব ও প্রাকৃতিক বিজ্ঞানের নীতিমালা অনুসরণ করতেন। অন্যদিকে ইবনে আল-শাতির এসব নীতি অনুসরণের সঙ্গে সংশ্লিষ্ট ছিলেন না। এরিস্টোটলীয় পদার্থ বিজ্ঞানের নীতিমালাও তিনি অনুসরণ করেননি, বরং তিনি এমন একটি মডেল উদ্ভাবন করেন, যা ছিল বিজ্ঞানসম্মত পর্যবেক্ষণের সঙ্গে সংগতিপূর্ণ। তার প্রণীত গ্রন্থ জ্যোতির্বিজ্ঞানে একটি মোড় পরিবর্তনের সূচনা করে। যাকে রেনেসা পূর্ব একটি বৈজ্ঞানিক বিপ্লব হিসেবে আখ্যায়িত করা যায়।\n" +
                        "\n" +
                        "শাতির একটি জিজ তৈরির মধ্য দিয়ে সৌরমণ্ডলীয় জ্যোতির্বিজ্ঞানের ওপর কাজ শুরু করেছিলেন। টলেমির সৌরমণ্ডলীয় থিওরির ওপর রচিত এ জিজের অস্তিত্ব বিলীন হয়ে গেছে। পরবর্তী সময়ে তিনি যেসব পর্যবেক্ষণ ও পদ্ধতির ভিত্তিতে একটি নয়া সৌরমণ্ডলীয় মডেল নির্মাণ করেছিলেন তালিক আল-আরশাদ শিরোনামে একটি গ্রন্থে তার বর্ণনা দেন। এ গ্রন্থটিরও কোনো অস্তিত্ব নেই। তবে অন্য কয়েকটি পাণ্ডুলিপিতে শাতিরের ‘আল-জিজ আল-জাদিদ’  (The New astronomical handbook)  সংরক্ষিত। এসব পাণ্ডুলিপিতে তার একগুচ্ছ নয়া সৌরমণ্ডলীয় তালিকা খুঁজে পাওয়া যায়। ত্রয়োদশ শতাব্দীতে মারাগা মানমন্দিরের কয়েকজন পণ্ডিতের রচনাবলিতে শাতিরের গ্রন্থের সূচনা উল্লেখ করা হয়।\n" +
                        "\n" +
                        "ইবনে আল-শাতির একটি বিস্ময়কর অনুভূমিক সূর্যঘড়ি তৈরি করেছিলেন। ঘড়িটি দামেস্কে উমাইয়া মসজিদের উত্তর মিনারে বসানো হয়েছিল। ঘড়িটির মূল যন্ত্রপাতি দামেস্কের জাতীয় জাদুঘরের বাগানে সংরক্ষিত। এ সূর্যঘড়ি দেখে মুয়াজ্জিন আজান দিতেন। মূল্যবান মার্বেল পাথরে তৈরি ঘড়িটির আকার ছিল ২ – ১ মিটার। শাতির আরেকটি ছোট ঘড়িও তৈরি করেছিলেন। এ ঘড়িটি আলেপ্পোতে সংরক্ষিত। ‘সানডুক আল-ইয়াওয়াকু’ (রত্ম বাক্স) নামে একটি বাক্সে ঘড়িটি রাখা হতো। এ ঘড়িটির আয়তন ছিল ১২ – ১২ – ৩ সেন্টিমিটার। জোহর ও আসরের নামাজ আদায়, স্থানীয় সময় এবং কেবলা নির্ধারণে ঘড়িটি ব্যবহার করা হতো। শাতির একটি চৌম্বকীয় কম্পাসও তৈরি করেছিলেন। ইবনে আল-শাতির প্রথম জ্যোতির্বিজ্ঞান বিষয়ক একটি বহুমুখী কম্পেনডিয়াম  (Compendium) নির্মাণ করেছিলেন। তার কস্পেনডিয়ামে অন্যান্য যন্ত্রপাতির মধ্যে ছিল জ্যোর্তিবিজ্ঞান বিষয়ক যন্ত্র এলহাইডাড  (Alhidade) এবং সূর্যঘড়ি। ইউরোপে রেনেসাঁ যুগে এ কম্পেনডিয়াম অত্যন্ত জনপ্রিয় হয়ে উঠেছিল।");
                arrayList.add(hashMap);





                hashMap = new HashMap<>();
                hashMap.put("cat","National");
                hashMap.put("image_url", "https://www.banglanews24.com/public/uploads/2022/11/23/1669221513.Japan-2.jpg");
                hashMap.put("title", "মিয়ানমারে গণতন্ত্র ফিরলে টেকসই রোহিঙ্গা প্রত্যাবাসন সম্ভব: জাপান");
                hashMap.put("des", " মিয়ানমারে গণতন্ত্র পুনঃপ্রতিষ্ঠার পর জোরপূর্বক বাস্তুচ্যুত রোহিঙ্গাদের টেকসই প্রত্যাবাসন সম্ভব হবে বলে মনে করেন জাপানের পররাষ্ট্র প্রতিমন্ত্রী তাকেই শুনসুকে।\n" +
                        "\n" +
                        "বুধবার (২৩ নভেম্বর) সন্ধ্যায় গণভবনে প্রধানমন্ত্রী শেখ হাসিনার সঙ্গে সৌজন্য সাক্ষাৎকালে তিনি একথা বলেন। পরে প্রধানমন্ত্রীর প্রেস সচিব ইহসানুল করিম সাংবাদিকদের ব্রিফ করেন।\n" +
                        "\n" +
                        "বৈঠকে জাপানের পররাষ্ট্র প্রতিমন্ত্রী বলেন, রোহিঙ্গা ইস্যুতে জাপান বাংলাদেশকে সমর্থন করে। রোহিঙ্গাদের টেকসই প্রত্যাবাসনে গণতন্ত্রের জন্য অপেক্ষা করতে হবে।\n" +
                        "\n" +
                        "এ প্রসঙ্গে প্রধানমন্ত্রী বলেন, রোহিঙ্গা প্রত্যাবাসন নিয়ে জাপান মিয়ানমারের সঙ্গে কথা বলতে পারে। রোহিঙ্গারা বাংলাদেশের জন্য ভারী বোঝা হয়ে দাঁড়িয়েছে। কারণ তারা বাংলাদেশে আশ্রয় নেওয়ার পর ইতোমধ্যে পাঁচ বছর পার হয়েছে। ক্যাম্পে নতুন শিশুর জন্মের সঙ্গে তাদের সংখ্যাও বাড়ছ");
                arrayList.add(hashMap);





                hashMap = new HashMap<>();
                hashMap.put("cat","International");
                hashMap.put("image_url", "https://images.hindustantimes.com/bangla/img/2022/11/09/600x338/UKRAINE-RUSSIA-CONFLICT-WAR-0_1668013103630_1668013103630_1668013118033_1668013118033.jpg");
                hashMap.put("title", "ইউক্রেনের শহর থেকে সরছে রাশিয়ার সেনা, যুদ্ধে বিরাট মোড়");
                hashMap.put("des", "এদিকে বিশেষজ্ঞদের মতে ৯ মাস ধরে টানা যুদ্ধ চলছে। তার মধ্যে এদিন রাশিয়ার এই পদক্ষের যথেষ্ট তাৎপর্যপূর্ণ। এটাকে টার্নিং পয়েন্ট বলেও মনে করছেন অনেকে। রাশিয়ার প্রতিরক্ষামন্ত্রী সের্গেই সোইগু বুধবার অধিগৃহীত ইউক্রেনের খেরসন শহর থেকে সেনা প্রত্যাহারে নির্দেশ দিলেন। নিপ্রো নদীর অপরপারে প্রতিরোধমূলক পদক্ষেপ নেওয়ার জন্যও বলা হয়েছে।\n" +
                        "\nএদিকে বিশেষজ্ঞদের মতে ৯ মাস ধরে টানা যুদ্ধ চলছে। তার মধ্যে এদিন রাশিয়ার এই পদক্ষের যথেষ্ট তাৎপর্যপূর্ণ। এটাকে টার্নিং পয়েন্ট বলেও মনে করছেন অনেকে।\n" +
                        "\n" +
                        "টেলিভিশনে সম্প্রচারিত খবর অনুসারে জেনারেল সের্গেই সুরোভিকিন জানিয়েছেন, সামগ্রিক পরিস্থিতি খতিয়ে দেখে সিদ্ধান্ত নেওয়া হয়েছে নিপ্রো নদীর বাঁ তির বরাবর প্রতিরক্ষামূলক ব্যবস্থা নেওয়া হবে। একটি ম্যাপ দেখিয়ে তিনি এই নির্দেশ দেন।\n" +
                        "\n" +
                        "তিনি বলেন, আমি বুঝতে পারছি এটা খুব কঠিন সিদ্ধান্ত। কিন্তু এটা আমাদের মনে রাখতে হচ্ছে যে আমাদের সেনাদের জীবনটাও খুব গুরুত্বপূর্ণ।\n" +
                        "\n" +
                        "এদিকে খেরসন শহরের নামে একটি রিজিয়নও আছে। " );
                arrayList.add(hashMap);





            }

        }









